espressif/esp-idf/components/soc/esp32s31/register/soc/lp_spi_struct.h
/**
 * SPDX-FileCopyrightText: 2025-2026 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: LP SPI CMD REG */
/** Type of spi_cmd register
 *  Command control register
 */
typedef union {
    struct {
        uint32_t reserved_0:23;
        /** reg_update : WT; bitpos: [23]; default: 0;
         *  Set this bit to synchronize SPI registers from APB clock domain into SPI module
         *  clock domain, which is only used in SPI master mode.
         */
        uint32_t reg_update:1;
        /** reg_usr : R/W/SC; bitpos: [24]; default: 0;
         *  User define command enable.  An operation will be triggered when the bit is set.
         *  The bit will be cleared once the operation done.1: enable 0: disable. Can not be
         *  changed by CONF_buf.
         */
        uint32_t reg_usr:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} lp_spi_cmd_reg_t;


/** Group: LP SPI ADDR REG */
/** Type of spi_addr register
 *  Address value register
 */
typedef union {
    struct {
        /** reg_usr_addr_value : R/W; bitpos: [31:0]; default: 0;
         *  Address to slave. Can be configured in CONF state.
         */
        uint32_t reg_usr_addr_value:32;
    };
    uint32_t val;
} lp_spi_addr_reg_t;


/** Group: LP SPI CTRL REG */
/** Type of spi_ctrl register
 *  SPI control register
 */
typedef union {
    struct {
        uint32_t reserved_0:3;
        /** reg_dummy_out : R/W; bitpos: [3]; default: 0;
         *  In the dummy phase the signal level of spi is output by the spi controller. Can be
         *  configured in CONF state.
         */
        uint32_t reg_dummy_out:1;
        uint32_t reserved_4:14;
        /** reg_q_pol : R/W; bitpos: [18]; default: 1;
         *  The bit is used to set MISO line polarity, 1: high 0, low. Can be configured in
         *  CONF state.
         */
        uint32_t reg_q_pol:1;
        /** reg_d_pol : R/W; bitpos: [19]; default: 1;
         *  The bit is used to set MOSI line polarity, 1: high 0, low. Can be configured in
         *  CONF state.
         */
        uint32_t reg_d_pol:1;
        uint32_t reserved_20:5;
        /** reg_rd_bit_order : R/W; bitpos: [25]; default: 0;
         *  In read-data (MISO) phase 1: LSB first 0: MSB first. Can be configured in CONF
         *  state.
         */
        uint32_t reg_rd_bit_order:1;
        /** reg_wr_bit_order : R/W; bitpos: [26]; default: 0;
         *  In command address write-data (MOSI) phases 1: LSB firs 0: MSB first. Can be
         *  configured in CONF state.
         */
        uint32_t reg_wr_bit_order:1;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} lp_spi_ctrl_reg_t;


/** Group: LP SPI CLOCK REG */
/** Type of spi_clock register
 *  SPI clock control register
 */
typedef union {
    struct {
        /** reg_clkcnt_l : R/W; bitpos: [5:0]; default: 3;
         *  In the master mode it must be equal to spi_clkcnt_N. In the slave mode it must be
         *  0. Can be configured in CONF state.
         */
        uint32_t reg_clkcnt_l:6;
        /** reg_clkcnt_h : R/W; bitpos: [11:6]; default: 1;
         *  In the master mode it must be floor((spi_clkcnt_N+1)/2-1). In the slave mode it
         *  must be 0. Can be configured in CONF state.
         */
        uint32_t reg_clkcnt_h:6;
        /** reg_clkcnt_n : R/W; bitpos: [17:12]; default: 3;
         *  In the master mode it is the divider of spi_clk. So spi_clk frequency is
         *  system/(spi_clkdiv_pre+1)/(spi_clkcnt_N+1). Can be configured in CONF state.
         */
        uint32_t reg_clkcnt_n:6;
        /** reg_clkdiv_pre : R/W; bitpos: [21:18]; default: 0;
         *  In the master mode it is pre-divider of spi_clk.  Can be configured in CONF state.
         */
        uint32_t reg_clkdiv_pre:4;
        uint32_t reserved_22:9;
        /** reg_clk_equ_sysclk : R/W; bitpos: [31]; default: 1;
         *  In the master mode 1: spi_clk is equal to system 0: spi_clk is divided from system
         *  clock. Can be configured in CONF state.
         */
        uint32_t reg_clk_equ_sysclk:1;
    };
    uint32_t val;
} lp_spi_clock_reg_t;


/** Group: LP SPI USER REG */
/** Type of spi_user register
 *  SPI USER control register
 */
typedef union {
    struct {
        /** reg_doutdin : R/W; bitpos: [0]; default: 0;
         *  Set the bit to enable full duplex communication. 1: enable 0: disable. Can be
         *  configured in CONF state.
         */
        uint32_t reg_doutdin:1;
        uint32_t reserved_1:4;
        /** reg_tsck_i_edge : R/W; bitpos: [5]; default: 0;
         *  In the slave mode, this bit can be used to change the polarity of tsck. 0: tsck =
         *  spi_ck_i. 1:tsck = !spi_ck_i.
         */
        uint32_t reg_tsck_i_edge:1;
        /** reg_cs_hold : R/W; bitpos: [6]; default: 1;
         *  spi cs keep low when spi is in  done  phase. 1: enable 0: disable. Can be
         *  configured in CONF state.
         */
        uint32_t reg_cs_hold:1;
        /** reg_cs_setup : R/W; bitpos: [7]; default: 1;
         *  spi cs is enable when spi is in  prepare  phase. 1: enable 0: disable. Can be
         *  configured in CONF state.
         */
        uint32_t reg_cs_setup:1;
        /** reg_rsck_i_edge : R/W; bitpos: [8]; default: 0;
         *  In the slave mode, this bit can be used to change the polarity of rsck. 0: rsck =
         *  !spi_ck_i. 1:rsck = spi_ck_i.
         */
        uint32_t reg_rsck_i_edge:1;
        /** reg_ck_out_edge : R/W; bitpos: [9]; default: 0;
         *  the bit combined with spi_mosi_delay_mode bits to set mosi signal delay mode. Can
         *  be configured in CONF state.
         */
        uint32_t reg_ck_out_edge:1;
        uint32_t reserved_10:7;
        /** reg_sio : R/W; bitpos: [17]; default: 0;
         *  Set the bit to enable 3-line half duplex communication mosi and miso signals share
         *  the same pin. 1: enable 0: disable. Can be configured in CONF state.
         */
        uint32_t reg_sio:1;
        uint32_t reserved_18:6;
        /** reg_usr_miso_highpart : R/W; bitpos: [24]; default: 0;
         *  read-data phase only access to high-part of the buffer spi_w8~spi_w15. 1: enable 0:
         *  disable. Can be configured in CONF state.
         */
        uint32_t reg_usr_miso_highpart:1;
        /** reg_usr_mosi_highpart : R/W; bitpos: [25]; default: 0;
         *  write-data phase only access to high-part of the buffer spi_w8~spi_w15. 1: enable
         *  0: disable.  Can be configured in CONF state.
         */
        uint32_t reg_usr_mosi_highpart:1;
        /** reg_usr_dummy_idle : R/W; bitpos: [26]; default: 0;
         *  spi clock is disable in dummy phase when the bit is enable. Can be configured in
         *  CONF state.
         */
        uint32_t reg_usr_dummy_idle:1;
        /** reg_usr_mosi : R/W; bitpos: [27]; default: 0;
         *  This bit enable the write-data phase of an operation. Can be configured in CONF
         *  state.
         */
        uint32_t reg_usr_mosi:1;
        /** reg_usr_miso : R/W; bitpos: [28]; default: 0;
         *  This bit enable the read-data phase of an operation. Can be configured in CONF
         *  state.
         */
        uint32_t reg_usr_miso:1;
        /** reg_usr_dummy : R/W; bitpos: [29]; default: 0;
         *  This bit enable the dummy phase of an operation. Can be configured in CONF state.
         */
        uint32_t reg_usr_dummy:1;
        /** reg_usr_addr : R/W; bitpos: [30]; default: 0;
         *  This bit enable the address phase of an operation. Can be configured in CONF state.
         */
        uint32_t reg_usr_addr:1;
        /** reg_usr_command : R/W; bitpos: [31]; default: 1;
         *  This bit enable the command phase of an operation. Can be configured in CONF state.
         */
        uint32_t reg_usr_command:1;
    };
    uint32_t val;
} lp_spi_user_reg_t;


/** Group: LP SPI USER1 REG */
/** Type of spi_user1 register
 *  SPI USER control register 1
 */
typedef union {
    struct {
        /** reg_usr_dummy_cyclelen : R/W; bitpos: [7:0]; default: 7;
         *  The length in spi_clk cycles of dummy phase. The register value shall be
         *  (cycle_num-1). Can be configured in CONF state.
         */
        uint32_t reg_usr_dummy_cyclelen:8;
        uint32_t reserved_8:8;
        /** reg_mst_wfull_err_end_en : R/W; bitpos: [16]; default: 1;
         *  1: SPI transfer is ended when SPI RX AFIFO wfull error is valid in GP-SPI master
         *  FD/HD-mode. 0: SPI transfer is not ended when SPI RX AFIFO wfull error is valid in
         *  GP-SPI master FD/HD-mode.
         */
        uint32_t reg_mst_wfull_err_end_en:1;
        /** reg_cs_setup_time : R/W; bitpos: [21:17]; default: 0;
         *  (cycles+1) of prepare phase by spi clock this bits are combined with spi_cs_setup
         *  bit. Can be configured in CONF state.
         */
        uint32_t reg_cs_setup_time:5;
        /** reg_cs_hold_time : R/W; bitpos: [26:22]; default: 1;
         *  delay cycles of cs pin by spi clock this bits are combined with spi_cs_hold bit.
         *  Can be configured in CONF state.
         */
        uint32_t reg_cs_hold_time:5;
        /** reg_usr_addr_bitlen : R/W; bitpos: [31:27]; default: 23;
         *  The length in bits of address phase. The register value shall be (bit_num-1). Can
         *  be configured in CONF state.
         */
        uint32_t reg_usr_addr_bitlen:5;
    };
    uint32_t val;
} lp_spi_user1_reg_t;


/** Group: LP SPI USER2 REG */
/** Type of spi_user2 register
 *  SPI USER control register 2
 */
typedef union {
    struct {
        /** reg_usr_command_value : R/W; bitpos: [15:0]; default: 0;
         *  The value of  command. Can be configured in CONF state.
         */
        uint32_t reg_usr_command_value:16;
        uint32_t reserved_16:11;
        /** reg_mst_rempty_err_end_en : R/W; bitpos: [27]; default: 1;
         *  1: SPI transfer is ended when SPI TX AFIFO read empty error is valid in GP-SPI
         *  master FD/HD-mode. 0: SPI transfer is not ended when SPI TX AFIFO read empty error
         *  is valid in GP-SPI master FD/HD-mode.
         */
        uint32_t reg_mst_rempty_err_end_en:1;
        /** reg_usr_command_bitlen : R/W; bitpos: [31:28]; default: 7;
         *  The length in bits of command phase. The register value shall be (bit_num-1). Can
         *  be configured in CONF state.
         */
        uint32_t reg_usr_command_bitlen:4;
    };
    uint32_t val;
} lp_spi_user2_reg_t;


/** Group: LP SPI MS DLEN REG */
/** Type of spi_ms_dlen register
 *  SPI data bit length control register
 */
typedef union {
    struct {
        /** reg_ms_data_bitlen : R/W; bitpos: [17:0]; default: 0;
         *  The value of these bits is the configured SPI transmission data bit length in
         *  master mode DMA controlled transfer or CPU controlled transfer. The value is also
         *  the configured bit length in slave mode DMA RX controlled transfer. The register
         *  value shall be (bit_num-1). Can be configured in CONF state.
         */
        uint32_t reg_ms_data_bitlen:18;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} lp_spi_ms_dlen_reg_t;


/** Group: LP SPI MISC REG */
/** Type of spi_misc register
 *  SPI misc register
 */
typedef union {
    struct {
        /** reg_cs0_dis : R/W; bitpos: [0]; default: 0;
         *  SPI CS$n pin enable, 1: disable CS$n, 0: spi_cs$n signal is from/to CS$n pin. Can
         *  be configured in CONF state.
         */
        uint32_t reg_cs0_dis:1;
        uint32_t reserved_1:5;
        /** reg_ck_dis : R/W; bitpos: [6]; default: 0;
         *  1: spi clk out disable,  0: spi clk out enable. Can be configured in CONF state.
         */
        uint32_t reg_ck_dis:1;
        /** reg_master_cs_pol : R/W; bitpos: [9:7]; default: 0;
         *  In the master mode the bits are the polarity of spi cs line, the value is
         *  equivalent to spi_cs ^ spi_master_cs_pol. Can be configured in CONF state.
         */
        uint32_t reg_master_cs_pol:3;
        uint32_t reserved_10:13;
        /** reg_slave_cs_pol : R/W; bitpos: [23]; default: 0;
         *  spi slave input cs polarity select. 1: inv  0: not change. Can be configured in
         *  CONF state.
         */
        uint32_t reg_slave_cs_pol:1;
        uint32_t reserved_24:5;
        /** reg_ck_idle_edge : R/W; bitpos: [29]; default: 0;
         *  1: spi clk line is high when idle     0: spi clk line is low when idle. Can be
         *  configured in CONF state.
         */
        uint32_t reg_ck_idle_edge:1;
        /** reg_cs_keep_active : R/W; bitpos: [30]; default: 0;
         *  spi cs line keep low when the bit is set. Can be configured in CONF state.
         */
        uint32_t reg_cs_keep_active:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} lp_spi_misc_reg_t;


